{
    "background": "Background",
    "projects": "Projects",
    "workflow": "Workflow",
    "contacts": "Contacts",


    "handwrite": "Designed in Figma, illustrated on Adobe, and fully coded on React.",
    "name": "Robin Park",
    "prof": "UI / UX Designer",
    "moto": "Converting your ideas into pixel-perfect products for users.",
    
    
    "about": "Background",
    "about-intro": "My diverse background drives innovative, user-focused, design solutions.",
    "past1": "Neuroscientist",
    "date1": "2019 - 2020",
    "place1": "Nagoya University",
    "past2": "Esports Coach",
    "date2": "2020 - 2021",
    "place2-1": "Different Dimension",
    "place2-2": "Team Ashyva",
    "past3": "Frontend Developer",
    "date3": "2021 - 2022",
    "place3": "Nanum Digital Design Institute",
    "about-text": "As a former neuroscience researcher, esports coach, and front-end developer, I've carved a unique path to becoming a self-taught UI/UX designer. My journey has given me a unique set of skills that I bring to every design project. My background in neuroscience has deeply influenced my design philosophy. It's taught me how the mind works and how important details are, helping me build interfaces that are not just good to look at but easy to use. As an esports coach, I've learned to think strategically and communicate effectively, skills that have been crucial in crafting engaging user experiences and working smoothly with different teams. My experience in front-end development ensures that my designs are not only visually appealing but also technically feasible and grounded in practicality.",


    "skillset": "Skillset",
    "skill-text": "Using an ever-growing list of technologies that match industry standards.",

    "project": "Projects",
    "proText1": "As the sole product designer at Unibuzz, I was charged with the formidable task of turning a concept into reality: to transform university life through a unified social media platform designed specifically for students and faculty. This monumental project demanded extensive research, a deep understanding of social media usability, and a keen eye for the right design style. The project is ongoing, and I continue to refine and enhance the designs based on user feedback and collaborative efforts with the development team.",
    "proText2":"A friend who manages an Esports team approached me to address a common issue in the recruitment process for esports athletes and personnel: we predominantly relied on informal direct messaging through platforms like Twitter (X) or discord. Recognizing the need for a dedicated recruiting platform tailored to the esports market, we wanted a website that was not only easy to navigate but also specifically catered to gamers' UI preferences. Having first-hand experience with the esports world, I stepped in to offer my services, helping bring our vision to life.",
    "proText3":"'Sip at Home' is a passion project born from my frustration with the unavailability of online alcohol delivery services compared to other consumables. Recognizing a gap in the market, I designed preliminary mockups for a general alcohol delivery service catering to all beverage types. These designs are intended for potential entrepreneurs interested in developing this idea further. ",


    "workflow-intro":"A 7-step standardized design workflow applied to all my projects.",

    "slide-1": "1) Project Overview",
    "subtext-title1": "Identifying the goal of the project",
    "subtext-1": "The first and most important step. Identifying the goal of a UX/UI project is like setting the compass before a journey. It means really digging into what the project is meant to achieve, understanding who it's for, and figuring out what will make it a success. Through conversations with stakeholders and potential users, I capture the needs and define the key outcomes. This step creates a shared vision that keeps everyone on the same page, guiding all my future design choices.",
    "subtext-title2":"Brainstorming Phase",
    "subtext-2": "After defining the goals and objectives for the project, I jot down as many ideas as possible. To keep things organized, I encourage everyone to contribute to a single Figma or FigJam file. This centralized collection of ideas serves as the preliminary building blocks of the project. The goal of brainstorming is to lay out everything that comes up in our minds, quantity over quality.",

    "slide-2": "2) UX Research",
    "subtext-title3": "Begin UX Research with Value Proposition",
    "subtext-3": "Once the project outline has been set and the ideas flowing, I enter the UX research phase. I gather insights into user needs, behaviors, and motivations. I start by describing the unique value a product or service offers through a value proposition. This will outline the benefits, features, and experiences users can expect, aligning with their needs and desires.",
    "subtext-title4": "SWOT Analysis",
    "subtext-4": "A classic strategic tool in UX research, SWOT analysis is used to evaluate a project's strengths, weaknesses, opportunities, and threats. This helps me understand the internal and external factors affecting a product's success. I am able to leverage strengths, address weaknesses, capitalize on opportunities, and mitigate threats. Ultimately design a successful user-centered product.",
    "subtext-title5": "Competitive Audit",
    "subtext-5": "A competitive audit evaluates competing products or services to understand their strengths, weaknesses, and unique features. This analysis helps me understand what users expect from similar products and where a new or existing product can offer more value. I use this tool to gather insights into industry standards, identify gaps in the market, and uncover opportunities for differentiation.",
    "subtext-title6": "User Feedback Survey",
    "subtext-6": "By gathering user opinions and experiences I can understand user satisfaction, pain points, and capture real suggestions for improvement. Surveys can answer the questions I directly want from users, providing quantitative and qualitative data. Survey responses can not only be used during the development phase but also after the product has been launched.",


    "slide-3": "3) Visual Exploration",
    "subtext-title7": "Initial Visualization with Sketches",
    "subtext-7": "With all the foundations laid out by the previous steps, I can now start making basic sketches.These sketches will allow me to rapidly explore multiple design ideas without committing to specific details or structures. It is a good way to check with the team if certain design ideas or frameworks are okay or not.",
    "subtext-title8": "Product Sitemap",
    "subtext-8": "Sitemaps provide a visual and textual representation of a website's structure, outlining the relationships between pages and content areas. They help in mapping out the website's hierarchy which allows me to know the scope of the work as well as which pages I should start wireframing.",
    "subtext-title9": "User Flowchart",
    "subtext-9": "User flowcharts help me visualize and understand the paths users take while interacting with the product UI. They show a clear picture of user navigation compared to sitemaps, promoting a deeper understanding of user journeys.",
    "subtext-title10": "Greyscale Wireframe",
    "subtext-10": "With the sitemap and sketches, I can now create wireframes that act as blueprints for low fidelity designs. They will outline the structure and organization of a page or screen without detailed design elements. This also helps communicate the design flow better to stakeholders and developers. ",


    "slide-4": "4) Design System",
    "subtext-title11": "Deciding Color, Shape, Feel",
    "subtext-11": "Through multiple meetings, inspiration + mood boards, and UX research, its time to decide on the color, fonts, and shape of the product. Once this has been set, individual components can be created by integrating my extensive design system:",
    "subtext-title12": "Incorporation with Batch Styler",
    "subtext-12": "The Batch styler allows me to streamline and simplify the process of incorporating my design system components and templates to an individual project. It is a fast and efficient way to globally change fonts and colors. After batch styler does its work, individual components can be modified to match the project's needs.",


    "slide-5": "5) Style Guide",
    "subtext-title13": "Creating Reusable Components",
    "subtext-13": "With the design system integrated and modified to the project, I can now create reusable, interactive components for rapid designing and future prototyping. Components allow me to use ready-made navigations, buttons, links, images etc. This will improve efficiency and reduce repetitive design tasks.",
    "subtext-title14": "Illustrations and Media",
    "subtext-14": "By this point I should have a grasp of the general look of the designs, which should allow me to create the appropriate illustrations and media in Adobe Illustrator and Adobe Photoshop. The illustrations are reviewed by the team and approved before usage in high fidelity designs.",
    "subtext-title15": "Low fidelity Designs",
    "subtext-15": "At this phase of the project, early-stage design concepts are put to the test. I create full visualizations of how the final product might look at launch. The low fidelity designs are reviewed by the team and stakeholders, with any requested changes applied on the spot. Once the changes have also been reviewed and approved I transition to creating the high fidelity designs.",



    "slide-6": "6) High Fidelity Design",
    "subtext-title16": "Review of Hi-fi Designs",
    "subtext-16": "High fidelity designs closely resemble the final product, offering a realistic representation of the user interface. I first have the static designs reviewed by stakeholders and the rest of the team. Additional changes are applied if necessary.",
    "subtext-title17": "Review of Prototypes",
    "subtext-17": "Once the static pages have been approved, the remaining interactive elements, animations and transitions are included in the static pages. These prototypes will simulate the user experience once the product is launched. This level of interaction is essential for evaluating usability, navigation, and user engagement.",
    "subtext-title18": "Version History",
    "subtext-18": "At any stage of the design process, version history is important to keep records of previous designs and iterations. Figma provides autosaved and manually saved version of designs for every single file, all stored in the cloud. I take a combined approach of 'date + feature' to name each each version.",


    "slide-7": "7) Developer Handover",
    "subtext-title19": "Zeplin",
    "subtext-19": "The final step in my standardized workflow, I upload my high-fidelity designs to zeplin. Zeplin ensures design consistency and allows for color codes, fonts, spacing, margins, and other properties to be accessed by the development team. If the developers have any problems, I can also assist them with my own coding experience.",
    "subtext-title20": "Continuous Review and Redesign",
    "subtext-20": "As the developers work on the project, I have the final task of ensuring that implementation of the design's visual and functional elements are accurately translated. The design process never ends. It is a continuous loop that reflects the evolving nature of user needs, business requirements, and technology. Special thanks to unibuzz.org for allowing me to showcase my workflow through their materials! ",


    "contact": "Contacts",
    "phone": "Phone",
    "email": "Email",
    "socials": "Socials"
    
}
