{
    "background": "経歴",
    "projects": "プロジェクト",
    "workflow": "ワークフロー",
    "contacts": "連絡先",
    

    "handwrite": "Figmaでデザインされ、Reactでコーディングされています。100％完全レスポンシブ。",
    "name": "ロビン・パーク",
    "prof": "UI / UX デザイナー",
    "moto": "アイデアをピクセル単位で完璧な製品に変換し、ユーザーに提供します。",


    "about": "経歴",
    "about-intro": "私の多様な経歴は、革新的でユーザー重視のデザイン・ソリューションを推進します。.",
    "past1": "神経科学者",
    "date1": "2019 - 2020",
    "place1": "名古屋大学",
    "past2": "Esports 監督",
    "date2": "2020 - 2021",
    "place2-1": "Different Dimension",
    "place2-2": "Team Ashyva",
    "past3": "フロントエンド エンジニア",
    "date3": "2021 - 2022",
    "place3": "Nanum Digital Design Institute",
    "about-text":"元神経科学研究者、esports監督、フロントエンド エンジニアとして、私は独学でUI/UXデザイナーになるユニークな道を切り開きました。この旅のおかげで、あらゆるデザイン・プロジェクトに活かせるユニークなスキルを身につけることができました。神経科学のバックグラウンドは、私のデザイン哲学に深く影響しています。心がどのように働き、細部がいかに重要であるかを教えてくれたので、見栄えが良いだけでなく、使いやすいインターフェイスを構築するのに役立っています。esportsの監督として、私は戦略的思考と効果的なコミュニケーションを学びました。このスキルは、魅力的なユーザー体験を作り上げ、さまざまなチームと円滑に仕事をする上で非常に重要です。フロントエンド開発の経験から、私のデザインは視覚的に魅力的であるだけでなく、技術的に実現可能で、実用的であることを保証します",

    "skillset": "芸域",
    "skill-text": "業界基準に合致する絶えず増え続ける技術リストを使用しています。",

    "project": " プロジェクト",
    "proText1": "Unibuzzの唯一のプロダクトデザイナーとして、私はコンセプトを現実に変えるという困難な仕事を任されました：学生と教職員のために特別にデザインされた統一されたソーシャルメディアプラットフォームを通して、大学生活を変えることです。この途方もないプロジェクトには、広範なリサーチ、ソーシャルメディアのユーザビリティに対する深い理解、そして適切なデザインスタイルを見抜く鋭い目が必要でした。このプロジェクトは現在も進行中で、私はユーザーからのフィードバックや開発チームとの共同作業に基づいて、デザインの改良と改善を続けています",
    "proText2":"esportsチームを運営する友人から、esportsの選手や人材の採用プロセスでよくある問題を解決したいと相談を受けました。私たちは、esports市場に合わせた専用のリクルーティング・プラットフォームの必要性を認識し、ナビゲートが簡単なだけでなく、ゲーマーのUI嗜好に特化したウェブサイトを求めていました。esportsの世界での実体験を持つ私は、自分のサービスを提供するために足を踏み入れ、私たちのビジョンを実現する手助けをしました。",
    "proText3":"「Sip at Home」は、他の消耗品に比べ、オンライン・アルコール・デリバリー・サービスが利用できないことへの不満から生まれた情熱的なプロジェクトである。市場のギャップを認識した私は、あらゆる種類の飲料に対応する一般的なアルコール・デリバリー・サービスの予備的なモックアップをデザインした。これらのデザインは、このアイデアをさらに発展させることに興味を持つ潜在的な起業家のためのものです。",


    "workflow-intro":"私のすべてのプロジェクトに適用される7ステップの標準化されたデザインワークフロー。",
    "slide-1": "1) プロジェクトの概要",
    "subtext-title1": "プロジェクトの目標を特定する",
    "subtext-1": "最初で最も重要なステップ。UX/UIプロジェクトの目標を特定することは、旅行前にコンパスを設定するようなものです。これは、プロジェクトが達成しようとしていることを本当に掘り下げ、それが誰のためのものかを理解し、何が成功をもたらすかを見極めることを意味します。ステークホルダーや潜在的なユーザーとの対話を通じて、私はニーズを捉え、重要な成果を定義します。このステップは、全員が同じページを共有するビジョンを作り出し、私の将来のデザイン選択を導くものです。",
    "subtext-title2":"ブレインストーミング",
    "subtext-2": "プロジェクトの目標と目的を定義した後、可能な限り多くのアイデアをメモします。整理を保つために、全員にFigmaまたはFigJamのファイルに貢献するよう促します。この中央集約されたアイデア集はプロジェクトの予備的な構成要素として機能します。ブレインストーミングの目的は、私たちの頭に浮かぶすべてのことを展開することであり、量が質に勝ります。",
    
    "slide-2": "2) UX リサーチ",
    "subtext-title3": "バリュープロポジションからUXリサーチを開始する",
    "subtext-3": "プロジェクトの概要が設定され、アイデアが流れ出したら、UXリサーチフェーズに入ります。ユーザーのニーズ、行動、動機に関する洞察を収集します。まず、製品やサービスが提供するユニークな価値をバリュープロポジションを通じて説明します。これにより、ユーザーが期待できる利点、特徴、体験が概説され、彼らのニーズや願望と調和します。",
    "subtext-title4": "SWOT分析",
    "subtext-4": "UXリサーチにおける古典的な戦略ツールであるSWOT分析は、プロジェクトの強み、弱み、機会、脅威を評価するために使われる。これは、製品の成功に影響を与える内部要因と外部要因を理解するのに役立ちます。私は強みを活用し、弱みに対処し、機会を活用し、脅威を軽減することができます。最終的には、ユーザー中心の製品を設計し、成功に導きます。",
    "subtext-title5": "競争監査",
    "subtext-5": "競合監査では、競合する製品やサービスを評価し、その強み、弱み、独自の特徴を理解する。この分析は、ユーザーが類似製品に何を期待しているのか、新製品や既存製品がより高い価値を提供できるのはどこなのかを理解するのに役立ちます。私はこのツールを使って、業界標準に関する洞察を集め、市場のギャップを特定し、差別化の機会を明らかにします。",
    "subtext-title6": "ユーザー・フィードバック調査",
    "subtext-6": "ユーザーの意見や経験を収集することで、ユーザーの満足度やペインポイントを理解し、改善のための真の提案を把握することができます。アンケートは、私がユーザーから直接欲しい質問に答えることができ、定量的・定性的なデータを提供します。アンケートの回答は、開発段階だけでなく、製品が発売された後にも利用することができます。",


    "slide-3": "3) ビジュアル探検",
    "subtext-title7": "スケッチによる最初の視覚化",
    "subtext-7": "これらのスケッチによって、特定の詳細や構造にコミットすることなく、複数のデザインアイデアを迅速に探索することができます。特定のデザインアイデアやフレームワークがOKかどうかをチームに確認する良い方法だ。",
    "subtext-title8": "商品サイトマップ",
    "subtext-8": "サイトマップは、ウェブサイトの構造を視覚的かつテキスト的に表現し、ページとコンテンツエリアの関係を概説します。ウェブサイトの階層をマッピングするのに役立ち、作業の範囲やどのページからワイヤーフレームを作成すべきかを知ることができます。",
    "subtext-title9": "ユーザーフローチャート",
    "subtext-9": "ユーザーフローチャートは、ユーザーが製品のUIとインタラクトしている間の経路を視覚化し、理解するのに役立つ。サイトマップと比較して、ユーザーナビゲーションの明確なイメージを示し、ユーザージャーニーのより深い理解を促します。",
    "subtext-title10": "グレースケールのワイヤーフレーム",
    "subtext-10": "サイトマップとスケッチがあれば、忠実度の低いデザインの設計図として機能するワイヤーフレームを作成できるようになりました。ワイヤーフレームは、詳細なデザイン要素なしに、ページや画面の構造や構成の概要を示すものです。これはまた、利害関係者や開発者にデザインの流れをよりよく伝えるのにも役立ちます。 ",


    "slide-4": "4) デザインシステム",
    "subtext-title11": "色、形、感触を決める",
    "subtext-11": "何度もミーティングを重ね、インスピレーションやムードボード、UXリサーチを経て、製品の色やフォント、形を決めていきます。これが決まれば、私の広範なデザインシステムを統合することで、個々のコンポーネントを作成することができる:",
    "subtext-title12": "バッチスタイラーによる組み込み",
    "subtext-12": "バッチスタイラーを使用すると、デザインシステムのコンポーネントやテンプレートを個々のプロジェクトに組み込むプロセスを合理化、簡素化できます。これは、フォントや色をグローバルに変更するための高速で効率的な方法です。バッチスタイラーが作業を行った後、個々のコンポーネントをプロジェクトのニーズに合わせて変更することができます。",


    "slide-5": "5) スタイルガイド",
    "subtext-title13": "再利用可能なコンポーネントの作成",
    "subtext-13": "デザインシステムがプロジェクトに統合され、修正されたことで、迅速なデザインと将来のプロトタイピングのために、再利用可能でインタラクティブなコンポーネントを作成できるようになりました。コンポーネントによって、私は既製のナビゲーション、ボタン、リンク、画像などを使うことができる。これによって効率が向上し、反復的なデザイン作業を減らすことができます。",
    "subtext-title14": "イラストレーションとメディア",
    "subtext-14": "この時点までに、デザインの大まかな外観を把握し、Adobe IllustratorとAdobe Photoshopで適切なイラストとメディアを作成できるようにしておく。イラストはチームによって確認され、忠実度の高いデザインで使用する前に承認されます。",
    "subtext-title15":"低忠実度デザイン",
    "subtext-15": "プロジェクトのこの段階では、初期段階のデザインコンセプトがテストされる。私は、最終製品が発売時にどのように見えるかの完全な視覚化を作成します。ローフィデリティのデザインはチームとステークホルダーによってレビューされ、要求された変更があればその場で適用されます。変更がレビューされ、承認されると、私はハイ・フィデリティ・デザインの作成に移行します。",



    "slide-6" : "6) 高忠実度デザイン",
    "subtext-title16": "ハイファイ・デザインのレビュー",
    "subtext-16": "ハイフィデリティデザインは最終製品に近く、ユーザーインターフェイスの現実的な表現を提供します。私はまず、静的デザインを利害関係者とチームの他のメンバーにレビューしてもらいます。必要に応じて追加の変更を加えます。",
    "subtext-title17": "プロトタイプのレビュー",
    "subtext-17": "静的ページが承認されると、残りのインタラクティブ要素、アニメーション、トランジションが静的ページに含まれる。これらのプロトタイプは、製品が発売された後のユーザー体験をシミュレートします。このレベルのインタラクションは、ユーザビリティ、ナビゲーション、ユーザーエンゲージメントを評価するために不可欠です。",
    "subtext-title18": "バージョン履歴",
    "subtext-18": "設計プロセスのどの段階においても、バージョン履歴は、以前の設計や反復の記録を保持するために重要です。Figmaは、クラウドに保存されたすべてのファイルに対して、自動保存と手動保存のバージョン履歴を提供します。私は、それぞれのバージョンに名前を付けるために、'日付＋機能'という複合的なアプローチを取っています。",



    "slide-7": "7) 開発者の引き継ぎ",
    "subtext-title19": "Zeplin",
    "subtext-19": "標準化されたワークフローの最終段階として、私は忠実度の高いデザインをzeplinにアップロードします。Zeplinはデザインの一貫性を保証し、カラーコード、フォント、スペーシング、マージン、その他のプロパティに開発チームがアクセスできるようにします。開発者に何か問題があれば、私自身のコーディング経験でサポートすることもできます",
    "subtext-title20": "継続的な見直しと再設計",
    "subtext-20": "開発者がプロジェクトに取り組んでいる間、私はデザインの視覚的・機能的要素の実装が正確に翻訳されていることを確認する最終的な仕事をする。デザイン・プロセスに終わりはない。ユーザーニーズ、ビジネス要件、テクノロジーの進化を反映した、継続的なループなのだ。unibuzz.orgの資料を通して私のワークフローを紹介することを許可してくれたunibuzz.orgに感謝します！",

    "contact": "連絡先",
    "phone": "電話番号",
    "email": "メール",
    "socials": "Socials"
}