{
    "background": "Background",
    "projects": "Projects",
    "workflow": "Workflow",
    "contacts": "Contact",

    "handwrite": "Figmaでデザイン、Reactでコーディング。100%レスポンシブウェブデザイン(RWD)。",
    "name": "Robin Park",
    "prof": "UI / UX デザイナー",
    "moto": "あなたのアイデアをそのままプロダクトとして実現し、ユーザーに提供する",
    
    
    "about": "Background",
    "about-intro": "いままで様々な経験をしてきたおかげで、ユーザーを思ったイノベーティブなデザインソリューションを提供できます",
    "past1": "神経科学の研究",
    "date1": "2019 - 2020",
    "place1": "名古屋大学",
    "past2": " eスポーツチームのコーチ",
    "date2": "2020 - 2021",
    "place2-1": "Different Dimension",
    "place2-2": "Team Ashyva",
    "past3": "フロントエンドエンジニア",
    "date3": "2021 - 2022",
    "place3": "Nanum Digital Design Institute",
    "about-text": "神経科学の研究、eスポーツコーチ、そしてフロントエンド開発をそれぞれ経験してきたおかげで、様々なスキルを身につけることができ、いろんなプロジェクトでそのスキルを活かせることができます。神経科学の研究所では、貴重な分析スキルと、全体像をより深く理解するために細かい部分から情報を引き出すことの重要性を学びました。eスポーツチームのコーチとして、チームメイトやマネージメントと仕事をする中で人間関係の問題に直面した場面があり、クリティカルシンキングが鍛えられ、問題についてロジカルに考えつつ、理想的な結末にたどり着けるよう取り組みました。フロントエンド開発の経験から、きれいなウェブインターフェースをゼロから作成する技術的なスキルを身につけました。 ",

    "skillset": "Skillset",
    "skill-text": "常に更新され続けている、様々なソフトウェアを使用しています",

    "project": "Projects",
    "project-label1": "大学生向けのSNSプラットフォーム",
    "project-label2": " eスポーツ業界向けの人材募集プラットフォーム",
    "project-label3": " お酒の配達サービス",
    "proText1": "スタートアップ企業Unibuzzのコファウンダーかつプロダクトデザイナーとして、あるアイデアを実現することを任されましたーー学生と教職員のためにデザインされた、統一されたSNSプラットフォームを作り出すこと。基本構想、UXリサーチ、フレームワークの計画、デザインなど、すべて一人で担当しています。このプロジェクトは現。在も進行中で、デベロッパーとユーザーからのフィードバックをもとに、デザインを改善し続けています。2024年10月公開予定。",
    "proText2":" eスポーツの人材採用プロセスで。こういう問題がありますーー採用プロセスは基本的にインフォーマルなSNSプラットフォーム（例：Twitter/X、Discordなど）を通じて行われることが多い。eスポーツチームを経営している友人から、この問題を解決したいとの相談を受けました。eスポーツ業界向けの人材募集プラットフォームが必要だと思い、使いやすさだけでなく、ゲーマーの好みに合わせたUIデザインとウェブサイトを作りたいと思いました。eスポーツ業界の経験がある自分なら、このビジョンを実現できるのではないかと、その友人と手を組むと決断しました。現在, エンジニアを募集しています。",
    "proText3":"他の飲食物に比べて、通販サイトではお酒飲料を購入するオプションが少ないということに不満を感じ、「Sip at Home」という個人的なプロジェクトの開発をはじめました。需要あるのではないかと思い、あらゆる種類のお酒飲料のカタログを含む配達サービスのウェブサイトモックアップをデザインしました。このデザインは、このアイデアの可能性をさらに追及したいと思っているインベスターに提供しようと思っています。 ",

    "workflow-intro": "すべてのプロジェクトに使う7ステップのデザインワークフロー",

    "slide-1": "1) プロジェクトの概要",
    "subtext-title1": "プロジェクトの目標を決める",
    "subtext-1": "最初でもっとも重要のステップとなります。ここではプロジェクトの目標を決め、何をなしたいか、誰のためのプロダクトなのか、成功させるには必要な要素は何かを決めます。ステークホルダーや見込み客と何度も話し合うことで、全員が共感できるビジョンを一緒に作り上げます。このステップで決めたことは今後すべてのデザイン選択に影響を与えます。",
    "subtext-title2":"ブレインストーミング",
    "subtext-2": "ブレーンストーミングの段階では、プロジェクトに関わっている全員がそれぞれアイデアを出し合い、プロジェクトに対して持っているビジョンを共有します。 ここでは、思いついたことをできるだけたくさんメモするようにしています。全員のアイデアをまとめるためにも、すべてのメンバーに1つのFigmaファイルまたはFigJamファイルを作るよう勧めています。このステップの目標は、最終クオリティに関係なく、プロジェクトに必要な要素をできるだけ集めることです。 ",

    "slide-2": "2) UXリサーチ",
    "subtext-title3": " バリュープロポジション",
    "subtext-3": "プロジェクトの概要が決まり、アイデアが湧いてきたら、UXリサーチの段階に入ります。まずはユーザーのニーズ、習慣、モチベーションに関する情報を集めることから始めます。次に、プロダクトがどうやってユーザーのニーズに応えてくれるのか、ユーザーがプロダクトを使ったところで期待できるベネフィットや機能の概要を説明するバリュープロポジションを作成します。",
    "subtext-title4": "SWOT分析",
    "subtext-4": " UXリサーチによく使われるツールの1つ。SWOT分析は、プロジェクトの強み(Strengths)、弱み(Weaknesses)、機会(Opportunities)、脅威(Threats)を分析するために使われます。プロダクトの成功に影響する内部環境と外部環境を理解するためのツールです。強みを活かし、弱みに対処し、機会を掴み、脅威を軽減することで、最終的にユーザーを思ったをデザインを作り上げることができます。",
    "subtext-title5": "競合分析",
    "subtext-5": "競合分析はSWOT分析と似ていて、競合他社のプロダクトやサービスと比較し、強み、弱み、特徴を理解することで、プロダクトをさらに分析する。この分析は、ユーザーが似たプロダクトに対して何を期待しているのか、新しいプロダクトや既存プロダクトがどの点でよく評価されるのかを理解するための分析です。このツールを使って、業界基準に関する情報を集め、需要を特定し、ニーズに特化したプロダクトを作り出だすチャンスとなります。",
    "subtext-title6": "ユーザーアンケート",
    "subtext-6": "ユーザーのフィードバックを集めることで、ユーザーの満足度やペインポイントを理解し、具体的な改善策を把握することができます。アンケートはユーザーから直接聞きだしたい情報を集めることができ、開発段階だけでなく、プロダクトローンチ後の段階でも活用できます。",

    "slide-3": "3) ビジュアルエクスプロレーション",
    "subtext-title7": "スケッチによる初期視覚化",
    "subtext-7": "これまでのステップでベースができたので、基本的なスケッチを描き始めることができます。ディテールにこだわらずに、複数のデザインアイデアを短時間で作り出せます。また、このアイデアまたはフレームワークがチーム全員がOKしてくれるものであるかどうかを確認するためのステップでもあります。",
    "subtext-title8": "プロダクトのサイトマップ",
    "subtext-8": "サイトマップは、ウェブサイトの構造を画像とテキストで表現し、ページやコンテンツエリアの関係を概説します。ウェブサイトのヒエラルキーをマッピングすることで、仕事の範囲やどのページからワイヤーフレームを作るべきかを把握することができます。",
    "subtext-title9": "ユーザーフローチャート",
    "subtext-9": "ユーザーフローチャートは、ユーザーがプロダクトのUIを操作する際にどのような経路をたどるかを視覚化し、理解するために作ります。サイトマップに比べて、ユーザーナビゲーションをよりクリアな画像で作り出し、ユーザージャーニーをよりクリアに把握することができます。",
    "subtext-title10": "白黒のワイヤーフレーム",
    "subtext-10": "サイトマップとスケッチが完成したら、Low Fidelity (Lo-Fi)デザインの設計図となるワイヤーフレームを作成します。ワイヤーフレームは、細かいデザイン要素を含まない、ページや画面の構造と構成を大体に表現するものです。これはステークホルダーやデベロッパーにデザインフローをわかりやすく伝えるためのものとなります ",

    "slide-4": "4) デザインシステム",
    "subtext-title11": "カラー、形、雰囲気を決める",
    "subtext-11": "何度もミーティングを重ね、インスピレーションやムードボード、UXリサーチを経て、プロダクトの形、使うカラーやフォントを決めます。これが決まれば、デザインシステムを統合することで、それぞれのコンポーネントを作ることができます。",
    "subtext-title12": "Batch Stylerで統合",
    "subtext-12": " Batch Stylerを使用することで、デザインシステムのコンポーネントやテンプレートをそれぞれのプロジェクトに組み込む作業を簡略化できます。すべてのフォントやカラーを統一するための効率的なツールの1つとなります。Batch Stylerを使用した後、それぞれのコンポーネントをプロジェクトのニーズに合わせてさらに調整することができます。",

    "slide-5": "5) スタイルガイド",
    "subtext-title13": "リユーザブルコンポーネントの作成",
    "subtext-13": "デザインシステムを統合し、プロジェクトに合わせてに調整した後、今後のプロトタイプに使うリユーザブルでインタラクティブなコンポーネントを作ることができます。コンポーネントを使うことで、既存のナビゲーション、ボタン、URL、画像などを使用することができます。これにより、時間を節約し、より効率的にデザイン作業を続けられます。",
    "subtext-title14": "画像、イラストなどの作成",
    "subtext-14": "この時点では大体のデザインを把握しているため、Adobe IllustratorとAdobe Photoshopでプロジェクトに必要なイラストや画像を作成することができます。完成したイラストはチームと一緒に確認し、OKしてくれたらHigh Fidelity (Hi-Fi)デザインで使用することになります。",
    "subtext-title15": "Low Fidelity (Lo-Fi) デザイン",
    "subtext-15": "この段階では、初期のデザインコンセプトが試されます。最終プロダクトがローンチ時のビジュアルに近いものを作成します。Lo-Fiデザインはチームとステークホルダーと一緒に見直し、変更したい点があればその場で変えます。その後の変更済みデザインもOKしてくれたら、Hi-Fiデザインの作成に移ります。",


    "slide-6": "6) High Fidelity (Hi-Fi) デザイン",
    "subtext-title16": "Hi-Fiデザインを見直す",
    "subtext-16": "Hi-Fiデザインは最終プロダクトにもっとも近い、UIをできるだけリアルに再現してるものとなります。まずは非インタラクティブのデザインをステークホルダーとチームメンバーに見直してもらいます。フィードバックに応じて変更してほしい点を変えます。",
    "subtext-title17": "プロトタイプを見直す",
    "subtext-17": "非インタラクティブのページデザインをOKしてくれたら、インタラクティブ要素（アニメーション、トランジションなど）をページに加えます。プロトタイプは、プロダクトがローンチされた後のユーザー体験を再現するよう作っています。こういったインタラクティブさは、ユーザビリティ、ナビゲーション、ユーザーエンゲージメントをしっかり理解するためにも不可欠だと思います。",
    "subtext-title18": "バージョン履歴",
    "subtext-18": "デザインプロセスのどの段階においても、バージョン履歴、以前のデザインバージョンを保存することがとても重要です。Figmaではすべてのデザインファイルを自動保存と手動保存、両方可能の上、すべてクラウドにも保存してくれます。各バージョンのファイル名には「日付＋機能」というネーミングシステムも使っています。",

    "slide-7": "7) デベロッパーへの引き渡し",
    "subtext-title19": "Zeplin",
    "subtext-19": "ワークフローの最終ステップ。Hi-FiデザインをZeplinにアップロードします。Zeplinはデザインの統一性を保証し、カラーコード、フォント、スペーシング、マージン等のプロパティを開発チームが簡単にアクセスできるようにしてくれます。デベロッパーが何か問題に直面場合には、自分のプログラミング経験を活かし直接サポートすることもできます。",
    "subtext-title20": "継続的な見直しと修正",
    "subtext-20": "デベロッパーが作業を続ける中、デザインの視覚的、機能的要素が正確に再現されているかを確認し続けます。デザインプロセスはこれで終わりではありません。ユーザーのニーズ、ビジネス要求、テクノロジーの進化を表した、継続的なループとなります。unibuzz.orgから許可をいただいた上で、資料や画像などを上記ワークフローの説明に使用させていただきました。unibuzz.orgに感謝します！ ",

    "contact": "Contact",
    "phone": "Phone",
    "email": "Email",
    "socials": "SNS"
    
}